Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This endpoint will be automatically generated based on the query inserted in the Rule Unit of the DRL file. It's an example of a stateless invocation (also called "pure function invocation") in which the execution of our business rules doesn't have any side effects. The output value returned is based uniquely on the input provided.
ja_jp: このエンドポイントは、DRLファイルのRule Unitに挿入されたクエリに基づいて自動的に生成されます。これは、ビジネス・ルールの実行が副作用を伴わないステートレス呼び出し（「純粋な関数呼び出し」とも呼ばれる）の例です。返される出力値は、提供された入力に一意に基づいています。

source: This ensures that maximum throughput can be achieved, but it also means that the implementation of an endpoint method should complete in a timely fashion otherwise the thread will be used for too longfootnote:["Too long" depends on your target concurrency. You may consider 1ms as too long for some endpoint heavily used, but 100ms might be acceptable for less used endpoints] and other requests will be queued up and lead to degraded throughput.
ja_jp: これにより、最大のスループットを達成することがきます。ただし、エンドポイントメソッドの実装がタイムリーに完了しなければならないことも意味しています。そうでなければ、スレッドの使用が長くなり過ぎてしまい footnote:["長過ぎる" は目標とする並列度次第です。頻繁に使用されるエンドポイントでは 1ms も長過ぎると考える場合もありますし、あまり使われないエンドポイントでは 100ms でも許容可能かもしれません。]、他のリクエストがキューイングされ、スループットの低下につながります。

source: This ensures that proxy configuration is validated early. This validation is consistent across all clients and extensions.
ja_jp: これにより、プロキシー設定が早期に検証されます。この検証は、すべてのクライアントとエクステンションで一貫しています。

source: This ensures that the test suite starts and terminates the managed database in a separate process as required for test execution.
ja_jp: これにより、テストスイートは、テスト実行に必要な別プロセスで管理データベースを起動し、終了します。

source: This environment variable resolves some incompatibilities between Quarkus and the AWS Lambda Custom Runtime environment.
ja_jp: この環境変数は、Quarkus と AWS Lambda カスタムランタイム環境間で互換性が保てない問題について解決します。

source: This environment variable resolves some incompatibilities between Quarkus and the Amazon Lambda Custom Runtime environment.
ja_jp: この環境変数は、QuarkusとAmazon Lambdaカスタムランタイム環境との間のいくつかの非互換性を解決します。

source: This error is the one you obtain when trying to use SSL while it was not explicitly enabled in your native executable.
ja_jp: このエラーは、ネイティブ実行可能ファイルで明示的に有効にしない状態でSSLを使用しようとしたときに発生するエラーです。

source: This error message means that the native compilation used more advanced instruction sets, not supported by the CPU running the application. To work around that issue, add the following line to the `application.properties`:
ja_jp: このエラー・メッセージは、ネイティブ・コンパイルが、アプリケーションを実行しているCPUがサポートしていない、より高度な命令セットを使用したことを意味します。 この問題を回避するには、 `application.properties` に以下の行を追加して下さい:

source: This event is described in JSON, but that's just one of the possibilities. Let's look at the fields.
ja_jp: このイベントはJSONで記述されていますが、それは可能性の一つに過ぎません。フィールドを見てみましょう。

source: This event is recorded by default. The following three JFR events are recorded in JFR chunks.
ja_jp: このイベントはデフォルトで記録されます。以下の 3 つの JFR イベントは JFR チャンクに記録されます。

source: This event is recorded when either the Quarkus REST or RESTEasy extension is enabled. The following three JFR events are recorded as soon as REST server processing is complete.
ja_jp: このイベントは、Quarkus REST または RESTEasy エクステンションのいずれかが有効化されている場合に記録されます。 REST サーバーの処理が完了するとすぐに、以下の 3 つの JFR イベントが記録されます。

source: This example corresponds to the following instructions in the Micrometer documentation: https://micrometer.io/docs/registry/statsD#_customizing_the_metrics_sink
ja_jp: この例は、Micrometerのドキュメントにある以下の指示に対応しています: https://micrometer.io/docs/registry/statsD#_customizing_the_metrics_sink

source: This example corresponds to the following instructions in the Micrometer documentation: link:https://micrometer.io/docs/registry/statsD#_customizing_the_metrics_sink[Micrometer StatsD: Customizing the Metrics Sink]
ja_jp: この例は、Micrometer ドキュメントの link:https://micrometer.io/docs/registry/statsD#_customizing_the_metrics_sink[Micrometer StatsD: Customizing the Metrics Sink] の手順に対応しています。

source: This example demonstrates a simple microservice setup with two protected endpoints:
ja_jp: この例では、2 つの保護されたエンドポイントを持つ単純なマイクロサービスのセットアップを示します。

source: This example demonstrates storing and accessing roles. To update an existing user or create a new one, annotate `public List<Role> roles` with `@Cascade(CascadeType.ALL)` or choose a specific `CascadeType`.
ja_jp: この例では、ロールの格納とアクセスを示します。既存のユーザを更新したり、新しいユーザを作成したりするには、 `public List<Role> roles` を `@Cascade(CascadeType.ALL)` でアノテーションするか、特定の `CascadeType` を選択してください。

source: This example highlights the use of role-based access control (RBAC) policies to protect resources. Key points include:
ja_jp: この例では、リソースを保護するためのロールベースのアクセス制御 (RBAC) ポリシーの使用について説明します。 主なポイントは次のとおりです。

source: This example is using recorder proxies; see the section on <<bytecode-recording,bytecode recording>> for more information.
ja_jp: この例では、レコーダープロキシーを使用しています。詳しくは、<<bytecode-recording,bytecode recording>> のセクションを参照してください。

source: This example is using recorder proxies; see the section on xref:bytecode-recording[bytecode recording] for more information.
ja_jp: この例ではレコーダープロキシーを使用しています。詳細については、 xref:bytecode-recording[バイトコード] 記録のセクションを参照してください。

source: This example rule uses Rule Units, a new concept introduced in Kogito that helps users to encapsulate the set of rules and the facts against which those rules will be matched. The facts inserted will be inserted into a `DataStore`, a type-safe entry point. To make everything work, we need to define both the RuleUnit and the DataStore, by creating a new class `PersonUnit` inside `src/main/java/org/acme/kogito` directory:
ja_jp: このルール例では、ルール・ユニットを使用しています。これは、Kogitoで導入された新しい概念で、ルールのセットと、それらのルールが照合されるファクトをカプセル化するのに役立ちます。挿入されたファクトは、型安全なエントリ・ポイントである `DataStore` に挿入されます。すべてを機能させるためには、 `src/main/java/org/acme/kogito` ディレクトリ内に新しいクラス `PersonUnit` を作成して、RuleUnit と DataStore の両方を定義する必要があります。

source: This example runs nonblocking. We could also return `Uni<Joke>`
ja_jp: この例はノンブロッキングで実行されます。 `Uni<Joke>` を返すこともできます。

source: This example runs nonblocking. We could also return `Uni<JsonArray>`
ja_jp: この例では非ブロッキングで実行されます。 `Uni<JsonArray> ` を返すこともできます。

source: This example showed how to use both the dynamic and typesafe GraphQL clients to call an external GraphQL service and explained the difference between the client types.
ja_jp: この例では、ダイナミックなGraphQLクライアントとタイプセーフなGraphQLクライアントの両方を使って外部のGraphQLサービスを呼び出す方法を示し、クライアントの種類の違いを説明しました。

source: This example shows how to configure the minimal log level for the categories `org.apache.kafka.clients` and `org.apache.kafka.common.utils`.
ja_jp: この例は、 `org.apache.kafka.clients` および `org.apache.kafka.common.utils` カテゴリーの最小ログレベルを設定する方法を示しています。

source: This example shows how you can build a simple microservice that offers two endpoints:
ja_jp: この例では、2 つのエンドポイントを提供するシンプルなマイクロサービスをビルドする方法を示します。

source: This example shows how you can configure the minimal log level on the categories `org.apache.kafka.clients` and `org.apache.kafka.common.utils`.
ja_jp: この例では、 `org.apache.kafka.clients` および `org.apache.kafka.common.utils` のカテゴリで最小ログレベルを設定する方法を示します。

source: This example uses Rule Units, a new concept introduced in Kogito that helps users to encapsulate the set of rules and the facts against which those rules will be matched.
ja_jp: この例では、Kogitoに導入された新しい概念であるルール・ユニットを使用しています。これは、ルールのセットと、それらのルールが照合されるファクトをカプセル化するのに役立ちます。

source: This example uses TX_LOG as the datasource name.
ja_jp: この例では、データソース名としてTX_LOGを使用しています。

source: This example was inspired by a popular GraphQL API.
ja_jp: この例は、人気のある GraphQL API にインスパイアされたものです。

source: This example, using https://github.com/quarkiverse/quarkus-reactive-messaging-http[Reactive Messaging HTTP] shows how to stream text data:
ja_jp: この例では、 https://github.com/quarkiverse/quarkus-reactive-messaging-http[Reactive Messaging HTTP] を使用して、テキストデータをストリーミングする方法を示しています。

source: This exception mapper is only added to verify during the tests that `ProtectedResource` returns `403` when the token has no expected role. Without this mapper, Quarkus REST (formerly RESTEasy Reactive) would correctly convert the exceptions that escape from REST client calls to `500` to avoid leaking the information from the downstream resources such as `ProtectedResource`. However, in the tests, it would not be possible to assert that `500` is caused by an authorization exception instead of some internal error.
ja_jp: この例外マッパーは、トークンに想定するロールがない場合に `ProtectedResource` が 403 を返すことをテスト中に検証するためにのみ追加されます。このマッパーがないと、Quarkus REST (旧 RESTEasy Reactive) は、REST クライアント呼び出しからエスケープされる例外を `500` に正しく変換して、 `ProtectedResource` などのダウンストリームリソースからの情報漏えいを回避します。 ただし、テストでは `500` が実際は内部エラーではなく、認可例外が原因であることをアサートできません。

source: This exception mapper is only added to verify during the tests that `ProtectedResource` returns `403` when the token has no expected role. Without this mapper `RESTEasy Reactive` will correctly convert the exceptions which will escape from REST Client calls to `500` to avoid leaking the information from the downstream resources such as `ProtectedResource` but in the tests it will not be possible to assert that `500` is in fact caused by an authorization exception as opposed to some internal error.
ja_jp: この例外マッパーは、トークンに期待されるロールがない場合に `ProtectedResource` が 403 を返すことをテスト中に検証するためにのみ追加されます。このマッパーがないと、 `RESTEasy Reactive` は、REST クライアント呼び出しからエスケープされる例外を `500` に正しく変換して、 `ProtectedResource` などのダウンストリームリソースからの情報漏えいを回避しますが、テストでは `500` が実際は内部エラーではなく、認可例外が原因であることをアサートすることはできません。

source: This excludes calls to the export endpoint itself.
ja_jp: これにより、エクスポートエンドポイント自体への呼び出しが除外されます。

source: This expanded configuration reference document demonstrates that Quarkus OIDC supports a lot of OIDC requirements with properties alone. But it is impossible to cover all the possible requirements only with the properties.
ja_jp: この拡張された設定リファレンスドキュメントは、Quarkus OIDC がプロパティーだけで多くの OIDC 要件をサポートしていることを示しています。しかし、プロパティーだけで考えられるすべての要件をカバーすることは不可能です。

source: This explain the specifics of using Hibernate ORM with Panache in a Kotlin project.
ja_jp: KotlinプロジェクトでHibernate ORMをPanacheで使う場合に固有の事情について説明します。

source: This explains the specifics of using Hibernate ORM with Panache in a Kotlin project.
ja_jp: KotlinプロジェクトでHibernate ORM with Panacheを使う場合に固有の事項について説明します。

source: This expression is also validated against the `Item` class and obviously there is no such property declared. However, there is a template extension method declared on the `TemplateExtensions` class - see below.
ja_jp: この式は `Item` クラスに対しても検証されており、明らかにそのようなプロパティーは宣言されていません。しかし、 `TemplateExtensions` クラスにはテンプレート拡張メソッドが宣言されています - 以下を参照してください。

source: This expression is used to inject a CSRF token header and token. This token will be verified by the CSRF filter against a CSRF cookie.
ja_jp: この式は CSRF トークン・ヘッダーとトークンを注入するために使われます。このトークンは CSRF フィルターによって CSRF クッキーと照合されます。

source: This expression is used to inject a CSRF token into a hidden form field. This token will be verified by the CSRF filter against a CSRF cookie.
ja_jp: この書式は、CSRF トークンを隠しフォームフィールドに注入するために使用されます。このトークンは CSRF フィルタによって CSRF クッキーと照合され検証されます。

source: This expression is validated. Try to change the expression to `cdi:Product.notHere` and the build will fail.
ja_jp: この式は検証されます。式を `cdi:Product.notHere` に変更してみてください。ビルドは失敗します。

source: This expression is validated. Try to change the expression to `{item.nonSense}` and the build should fail.
ja_jp: この式は検証済みです。式を `{item.nonSense}` に変更するとビルドに失敗します。

source: This expression is validated. `org.acme.Foo` must have a property `message` or a matching template extension method must exist.
ja_jp: この式は検証されています。`org.acme.Foo` はプロパティー `message` を持つか、一致するテンプレート拡張メソッドが存在しなければなりません。

source: This extension allows you to inject either:
ja_jp: このエクステンションでは、どちらかを注入することができます。

source: This extension also generates {openshift} resources such as image streams, build configuration, deployment, and service definitions. If your application includes the `quarkus-smallrye-health` extension, {openshift} can access the health endpoint and verify the startup, liveness, and readiness of your application.
ja_jp: このエクステンションは、イメージストリーム、ビルド設定、デプロイメント、サービス定義などの {openshift} リソースも生成します。アプリケーションに `quarkus-smallrye-health` エクステンションが含まれている場合、{openshift} は health エンドポイントにアクセスし、アプリケーションのstartup、liveness、readinessを確認できます。

source: This extension can be configured to use multiple backends simultaneously, allowing different caches to leverage either in-memory providers (like Caffeine) or distributed providers (like Redis) as needed, for example:
ja_jp: このエクステンションは、複数のバックエンドを同時に使用するように設定でき、必要に応じて、異なるキャッシュがインメモリープロバイダー (Caffeine など) または分散プロバイダー (Redis など) のいずれかを活用できるようにします。例:

source: This extension cannot be used at the same time as Hibernate ORM. See https://github.com/quarkusio/quarkus/issues/13425.
ja_jp: このエクステンションは、Hibernate ORM と同時に使用することはできません。 https://github.com/quarkusio/quarkus/issues/13425 を参照ください。

source: This extension collaborates with the OpenTelemetry extension. The events recorded by this extension have a trace ID and a span ID. These are recorded with the OpenTelemetry IDs respectively.
ja_jp: このエクステンションは OpenTelemetry エクステンションと連携します。 このエクステンションによって記録されるイベントには、トレース ID とスパン ID があります。これらはそれぞれ OpenTelemetry ID とともに記録されます。

source: This extension does not support xref:hibernate-orm.adoc#database-approach[database-based multitenancy] or xref:hibernate-orm.adoc#schema-approach[schema-based multitenancy] at the moment. xref:hibernate-orm.adoc#discriminator-approach[Discriminator-based multitenancy], on the other hand, is expected to work correctly. See https://github.com/quarkusio/quarkus/issues/15959.
ja_jp: このエクステンションは、現時点では xref:hibernate-orm.adoc#database-approach[データベースベースのマルチテナンシー] または xref:hibernate-orm.adoc#schema-approach[スキーマベースのマルチテナンシー] をサポートしていません。一方、xref:hibernate-orm.adoc#discriminator-approach[Discriminator ベースのマルチテナンシー] は正しく機能すると予想されます。詳細については、 https://github.com/quarkusio/quarkus/issues/15959 を参照してください。

source: This extension generates an asymmetric RSA 2024 bit signing key pair in the dev and test modes if the verification key has not been configured. Once the key pair is generated, the public RSA key is used to configure the `mp.jwt.verify.publickey` property, and the RSA private key is available to tests to sign tokens using `smallrye-jwt-build`, for example:
ja_jp: このエクステンションは、検証キーが設定されていない場合、開発モードとテストモードで非対称 RSA 2024 ビット署名キーペアを生成します。キーペアが生成されると、公開 RSA キーは `mp.jwt.verify.publickey` プロパティーを設定するために使用され、RSA 秘密キーは `smallrye-jwt-build` を使用してトークンに署名するためにテストで利用可能になります。例えば次のとおりです。

source: This extension is able to records multiple JFR events concurrently (emitted by different threads or from the same thread in the case of the reactive execution model). Thus, events might overlap in JMC. This could make it difficult for you to see the events you want to see. To avoid this, we recommend to use <<identifying-requests,Request IDs>> to filter events so that you only see the information about the requests you want to see.
ja_jp: このエクステンションは、複数の JFR イベントを同時に記録できます (異なるスレッドから発行されたもの、またはリアクティブ実行モデルの場合は同じスレッドから発行されたもの)。 したがって、JMC ではイベントが重複する可能性があります。 これにより、表示したいイベントを表示することが難しくなる可能性があります。 これを回避するには、<<identifying-requests,Request IDs>> を使用してイベントをフィルタリングし、表示したいリクエストに関する情報のみを表示します。

source: This extension is available in the `quarkus-junit5-component` dependency.
ja_jp: このエクステンションは、 `quarkus-junit5-component` 依存関係で利用できます。

source: This extension is available since Quarkus version 3.19.
ja_jp: このエクステンションは、Quarkus バージョン 3.19 以降で利用できます。

source: This extension is compatible only with Quarkus xref:security-oidc-bearer-token-authentication.adoc[OIDC service applications]. It complements explicit mechanisms such as role-based access control with dynamic authorization policies.
ja_jp: このエクステンションは、Quarkus xref:security-oidc-bearer-token-authentication.adoc[OIDC サービスアプリケーション] とのみ互換性があります。 ロールベースのアクセス制御などの明示的なメカニズムを動的認可ポリシーで補完します。

source: This extension is currently experimental, so its API may change, in particular names of classes or packages may change, even the module name. We are in the process of making it a public preview in order to obtain public feedback, so please report feedback either on link:https://quarkusio.zulipchat.com/#narrow/channel/187038-dev/topic/WG.20-.20Panache.2ENext/with/562916276[Zulip] or via link:https://github.com/orgs/quarkusio/projects/50/views/1[GitHub issues].
ja_jp: このエクステンションは現在実験段階にあるため、API が変更される可能性があります。特に、クラス名やパッケージ名、さらにはモジュール名も変更される可能性があります。現在、パブリックプレビュー化を進めており、皆様からのフィードバックを求めています。フィードバックは link:https://quarkusio.zulipchat.com/#narrow/channel/187038-dev/topic/WG.20-.20Panache.2ENext/with/562916276[Zulip] または link:https://github.com/orgs/quarkusio/projects/50/views/1[GitHub issues] までお寄せください。

source: This extension is deprecated, we advise considering the alternatives described above in this guide.
ja_jp: このエクステンションは非推奨です。このガイドで上記に説明した代替手段を検討することを推奨します。

source: This extension is developed by a third party and is part of the Quarkus Platform.
ja_jp: このエクステンションはサードパーティによって開発されたもので、Quarkus Platformの一部です。

source: This extension is not a Quarkus core extension, it is available as part of the Quarkiverse. Early feedback and contribution are requested to mature the idea.
ja_jp: このエクステンションはQuarkusのコアエクステンションではなく、Quarkiverseの一部として利用可能です。このアイデアを成熟させるために、初期のフィードバックと貢献をお願いします。

source: This extension is only intended to improve performance, it is perfectly fine not to use it.
ja_jp: このエクステンションはあくまでパフォーマンス向上のためのもので、使わなくても全く問題ありません。

source: This extension lets you configure a _default_ Infinispan client connections and _named_ ones. Named connections are essential to connect to multiple Infinispan clusters.
ja_jp: このエクステンションでは、 _デフォルトの_ Infinispanクライアント接続と _名前付き_ 接続を設定できます。名前付き接続は、複数の Infinispan クラスタに接続するために不可欠です。

source: This extension lets you configure a _default_ Redis client/data sources or _named_ ones. The latter is essential when you need to connect to multiple Redis instances.
ja_jp: このエクステンションでは、_デフォルトの_ Redis クライアント/データソースまたは _名前付き_ ソースを設定することができます。後者は、複数の Redis インスタンスに接続する必要がある場合に不可欠となります。

source: This extension only considers the default persistence unit at the moment: it's not possible to configure multiple persistence units, or even a single named persistence unit.
ja_jp: このエクステンションは、現時点ではデフォルトの永続化ユニットのみを考慮します。 複数の永続化ユニットや、単一の名前付き永続化ユニットを設定することはできません。

source: This extension provides Micrometer metrics and OpenTelemetry metrics, traces and logs. All data is managed and sent out by the OpenTelemetry extension.
ja_jp: このエクステンションは、Micrometer メトリクスと OpenTelemetry メトリクス、トレース、およびログを提供します。データはすべて OpenTelemetry エクステンションによって管理され、送信されます。

source: This extension provides a `@WithFunction` annotation that can be used to annotate `@QuarkusTest` test cases to start a Cloud Function invoker before you test cases and stop it at the end. This annotation must be configured with the type of the function you want to launch, and optionally the name of the function in case you have multiple functions inside your application.
ja_jp: このエクステンションは、 `@QuarkusTest` のテストケースに、テストケースの前に Cloud Function invoker を起動し、終了時に停止するためのアノテーションとして使用できる `@WithFunction` アノテーションを提供します。このアノテーションは、起動したい関数のタイプと、アプリケーション内に複数の関数がある場合は関数の名前をオプションで設定する必要があります。

source: This extension provides a light-weight support for using the opaque Bearer Tokens and validating them by calling an introspection endpoint.
ja_jp: このエクステンションは、opaque形式のBearerトークンを使用してイントロスペクションエンドポイントを呼び出して検証するための軽量サポートを提供します。

source: This extension provides imperative and reactive APIs and low-level and high-level (type-safe) clients.
ja_jp: このエクステンションは、命令型とリアクティブ型の API、および低レベルと高レベルの (タイプセーフな) クライアントを提供します。

source: This extension provides multiple ways to interact with Redis:
ja_jp: このエクステンションは、Redis と対話する複数の方法を提供します。

source: This extension provides support for both Micrometer and OpenTelemetry in Quarkus applications. It streamlines integration by incorporating both extensions along with a bridge that enables sending Micrometer metrics via OpenTelemetry.
ja_jp: このエクステンションは、Quarkus アプリケーションで Micrometer と OpenTelemetry の両方をサポートします。OpenTelemetry 経由で Micrometer メトリクスを送信できるようにするブリッジとともに両方のエクステンションを組み込むことでインテグレーションを効率化します。

source: This extension reuses the _main_ HTTP server.
ja_jp: このエクステンションは、_メイン_ の HTTP サーバーを再利用します。

source: This extension slightly differs from the RESTEasy default behavior as the default charset (if none is specified in your request) is UTF-8 rather than US-ASCII.
ja_jp: このエクステンションは RESTEasy のデフォルトの動作とは若干異なり、リクエストで何も指定されていない場合のデフォルトの文字セットは US-ASCII ではなく UTF-8 となります。

source: This extension uses https://github.com/ben-manes/caffeine[Caffeine] as its underlying caching provider. Caffeine is a high performance, near optimal caching library.
ja_jp: このエクステンションは、基礎となるキャッシュプロバイダとして link:https://github.com/ben-manes/caffeine[Caffeine] を使用しています。Caffeine は高性能で最適に近いキャッシングライブラリです。

source: This extension uses the Quarkus standard build steps mechanism to support GraalVM Native images. In the exceptional case that incompatible changes in a future picocli release cause any issue, the following configuration can be used to fall back to the annotation processor from the picocli project as a temporary workaround:
ja_jp: このエクステンションでは、Quarkus 標準のビルドステップメカニズムを使用して、GraalVM Nativeイメージをサポートしています。将来のpicocliリリースで互換性のない変更が問題を引き起こす例外的なケースでは、一時的な回避策として、以下の設定を使用してpicocliプロジェクトのアノテーションプロセッサーにフォールバックすることができます。

source: This extension uses the `logstash-gelf` library that allow more configuration options via system properties, you can access its documentation here: https://logging.paluch.biz/ .
ja_jp: このエクステンションは、システムプロパティーを介してより多くの設定オプションを提供する `logstash-gelf` ライブラリを使用しています。ドキュメントにはこちら: https://logging.paluch.biz/ からアクセスできます。

source: This extension uses the `logstash-gelf` library that allow more configuration options via system properties, you can access its documentation here: https://logging.paluch.biz/.
ja_jp: このエクステンションは、システムプロパティーを介してより多くの設定オプションを提供する `logstash-gelf` ライブラリを使用しています。 ドキュメントには https://logging.paluch.biz/ からアクセスできます。

source: This extension will automatically use the Security annotations within the package `jakarta.annotation.security` that are defined on your resource interfaces:
ja_jp: このエクステンションは、リソースインターフェイスに定義されているパッケージ `jakarta.annotation.security` 内の Security アノテーションを自動的に使用します。

source: This extension will automatically use the Security annotations within the package `javax.annotation.security` that are defined on your resource interfaces:
ja_jp: このエクステンションは、リソースインターフェイスに定義されているパッケージ `javax.annotation.security` 内の Security アノテーションを自動的に使用します。

source: This extension will configure your `quarkus-opentelemetry` and `quarkus-micrometer-registry-otlp` extensions to send data to the OTel Collector bundled with the Grafana OTel LGTM image.
ja_jp: このエクステンションは、Grafana OTel LGTM イメージにバンドルされている OTel Collector にデータを送信するために、 `quarkus-opentelemetry` および `quarkus-micrometer-registry-otlp` エクステンションを設定します。

source: This extension will replace the default `io.quarkus.oidc.TokenStateManager` with a database-based one.
ja_jp: このエクステンションは、デフォルトの `io.quarkus.oidc.TokenStateManager' をデータベースをベースとするものに置き換えます。

source: This fact makes AppCDS difficult to use for real world deployments where a CI pipeline is responsible for building and deploying applications.
ja_jp: この事実は、CIパイプラインがアプリケーションのビルドとデプロイを担当する実世界のデプロイメントにAppCDSを使用することを困難にしています。

source: This fact makes the use of AppCDS difficult to use for real world deployments where a CI pipeline is responsible for building and deploying applications.
ja_jp: この事実は、CIパイプラインがアプリケーションのビルドとデプロイを担当する実環境のデプロイでは、AppCDSの利用を困難にしている。

source: This feature can be used in both development and production environments.
ja_jp: この機能は、開発環境と本番環境の両方で使用できます。

source: This feature can be used to configure client-side field level encryption (CSFLE). Follows the instructions from https://www.mongodb.com/docs/manual/core/csfle/[the Mongo web site] to configure CSFLE:
ja_jp: この機能を使用して、Client-Side Field Level Encryption (CSFLE) を設定できます。 CSFLE を設定するには、 https://www.mongodb.com/docs/manual/core/csfle/[Mongo Web サイト] の手順に従います。
